app/controllers/comments_controller.rb

  def create
    @scotch = Scotch.find(params[:scotch_id])
    @comment = @scotch.comments.create(params[:comment])
---
SELECT "scotches".* FROM "scotches" WHERE "scotches"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "scotch_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "1234"], ["commenter", "asdf"], ["created_at", Tue, 26 Mar 2013 17:23:41 UTC +00:00], ["scotch_id", 1], ["updated_at", Tue, 26 Mar 2013 17:23:41 UTC +00:00]]

  def destroy
    @scotch = Scotch.find(params[:scotch_id])
    @comment = @scotch.comments.find(params[:id])
    @comment.destroy
---
SELECT "scotches".* FROM "scotches" WHERE "scotches"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."scotch_id" = 1 AND "comments"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]