app/controllers/scotches_controller.rb

SELECT "scotches".* FROM "scotches"
---
  def index
    @scotches = Scotch.all

SELECT "scotches".* FROM "scotches" WHERE "scotches"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @scotch = Scotch.find(params[:id])

SELECT "scotches".* FROM "scotches" WHERE "scotches"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @scotch = Scotch.find(params[:id])

INSERT INTO "scotches" ("age", "alcohol", "bottler", "country", "created_at", "description", "distillery", "name", "region", "style", "updated_at", "volume") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @scotch = Scotch.new(params[:scotch])

    respond_to do |format|
      if @scotch.save

SELECT "scotches".* FROM "scotches" WHERE "scotches"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "scotches" SET "description" = 'Nose: More like Lapsang Souchong tea than Lapsang Souchong! One of the smokiest noses from Islay. It''s big, very, very concentraded, and redolent of iodine, sweet spices, good, mature sherry and creamy vanilla. Stunning.
---
  def update
    @scotch = Scotch.find(params[:id])

    respond_to do |format|
      if @scotch.update_attributes(params[:scotch])

SELECT "scotches".* FROM "scotches" WHERE "scotches"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "scotches" WHERE "scotches"."id" = ?  [["id", 980190962]]
---
  def destroy
    @scotch = Scotch.find(params[:id])
    @scotch.destroy